Revit 2024 API
SpacingRuleLayout Enumeration
 Rules for laying out a series of equidistant points or parallel lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum SpacingRuleLayout
Visual Basic
Public Enumeration SpacingRuleLayout
Visual C++
public enum class SpacingRuleLayout
Members
Member name | Description
None |  No points or lines will be created.
FixedDistance |  Points or lines are separated by a fixed distance.
FixedNumber |  Fixed number of points or lines with uniform distance between them.
MaximumSpacing |  Points or lines are separated by at most the max distance.
MinimumSpacing |  Points or lines are separated by at least the minimum distance.
See Also
Autodesk.Revit.DB Namespace